In [23]:
import pandas as pd

In [24]:
data = pd.read_csv("data.csv")
data.head()

  INCIDENT_DATETIME          INCIDENT_BOROUGH  ZIPCODE
0     1/1/2005 0:00  RICHMOND / STATEN ISLAND    10314
1     1/1/2005 0:00                     BRONX    10458
2     1/1/2005 0:01                  BROOKLYN    11206
3     1/1/2005 0:01                    QUEENS    11102
4     1/1/2005 0:01                    QUEENS    11101

In [25]:
data1 = pd.read_csv("EMS_Incident_Dispatch_Data.csv")
data1.head()

  INCIDENT_DATETIME    BOROUGH  ZIPCODE
0     1/1/2011 2:19  MANHATTAN  10030.0
1     1/1/2011 2:19  MANHATTAN  10029.0
2     1/1/2011 2:19  MANHATTAN  10016.0
3     1/1/2011 2:19   BROOKLYN  11213.0
4     1/1/2011 2:20  MANHATTAN  10022.0

In [26]:
data1.columns = ["INCIDENT_DATETIME","INCIDENT_BOROUGH","ZIPCODE"]
data1.head()

  INCIDENT_DATETIME INCIDENT_BOROUGH  ZIPCODE
0     1/1/2011 2:19        MANHATTAN  10030.0
1     1/1/2011 2:19        MANHATTAN  10029.0
2     1/1/2011 2:19        MANHATTAN  10016.0
3     1/1/2011 2:19         BROOKLYN  11213.0
4     1/1/2011 2:20        MANHATTAN  10022.0

In [27]:
data = data.append(data1)

C:\Users\Muhammad Ansar\AppData\Local\Temp\ipykernel_11212\2824341490.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  data = data.append(data1)

In [28]:
data.to_csv("data.csv")